"""
Скрипт для создания курса с 15 уроками и заданиями
"""
import sys
import os
sys.path.append(os.path.dirname(os.path.dirname(os.path.abspath(__file__))))

from app.core.database import SessionLocal
from app.db.models import Course, Lesson, Assignment
from app.db.repository.courseRepo import CourseRepository
from app.db.repository.lessonRepo import LessonRepository
from app.db.repository.assignmentRepo import AssignmentRepository
from app.db.schemas.course import CourseCreate
from app.db.schemas.lesson import LessonCreate
from app.db.schemas.assignment import AssignmentCreate

# Данные для курса
COURSE_DATA = {
    "title": "Основы программирования на Python",
    "description": "Полный курс для начинающих программистов. Изучите основы Python, работу с данными, функции, классы и многое другое."
}

# Данные для уроков
LESSONS_DATA = [
    {
        "title": "Введение в Python",
        "content": """# Введение в Python

Python - это современный язык программирования высокого уровня, который широко используется в различных областях: веб-разработка, наука о данных, искусственный интеллект, автоматизация и многое другое.

## Что такое Python?

Python был создан Гвидо ван Россумом и впервые выпущен в 1991 году. Это интерпретируемый язык, что означает, что код выполняется построчно, без предварительной компиляции.

## Преимущества Python:

1. **Простота синтаксиса** - код легко читается и понимается
2. **Многофункциональность** - можно использовать для разных задач
3. **Большое сообщество** - множество библиотек и ресурсов
4. **Кроссплатформенность** - работает на Windows, Linux, macOS

## Первая программа

Давайте напишем нашу первую программу на Python:

```python
print("Привет, мир!")
```

Эта программа выводит текст "Привет, мир!" на экран.

## Переменные

В Python переменные создаются простым присваиванием:

```python
name = "Иван"
age = 25
height = 175.5
```

Python автоматически определяет тип переменной.""",
        "assignment": {
            "title": "Первая программа",
            "description": "Создайте свою первую программу на Python",
            "instructions": "Напишите программу, которая выводит ваше имя и возраст. Используйте функцию print() и переменные."
        }
    },
    {
        "title": "Типы данных",
        "content": """# Типы данных в Python
Python поддерживает различные типы данных. Давайте изучим основные из них.
## Числовые типы

### Целые числа (int)
```python
x = 10
y = -5
z = 0
```

### Числа с плавающей точкой (float)
```python
pi = 3.14
temperature = -5.5
```

## Строки (str)

Строки - это последовательности символов:
```python
name = "Иван"
message = 'Привет, мир!'
multiline = '''Это
многострочная
строка'''
```
    
## Списки (list)

Списки - это упорядоченные коллекции элементов:

```python
fruits = ["яблоко", "банан", "апельсин"]
numbers = [1, 2, 3, 4, 5]
mixed = [1, "два", 3.0]
```

## Словари (dict)

Словари хранят пары ключ-значение:

```python
person = {
    "name": "Иван",
    "age": 25,
    "city": "Москва"
}
```

## Булевы значения (bool)

```python
is_student = True
is_working = False
```""",
        "assignment": {
            "title": "Работа с типами данных",
            "description": "Практика работы с различными типами данных",
            "instructions": "Создайте программу, которая содержит: целое число, число с плавающей точкой, строку, список из 5 элементов и словарь с информацией о себе (имя, возраст, город). Выведите все эти данные на экран."
        }
    },
    {
        "title": "Операторы и выражения",
        "content": """# Операторы и выражения

Операторы позволяют выполнять различные операции с данными.

## Арифметические операторы

```python
a = 10
b = 3

print(a + b)  # Сложение: 13
print(a - b)  # Вычитание: 7
print(a * b)  # Умножение: 30
print(a / b)  # Деление: 3.333...
print(a // b) # Целочисленное деление: 3
print(a % b)  # Остаток от деления: 1
print(a ** b) # Возведение в степень: 1000
```

## Операторы сравнения

```python
x = 5
y = 10

print(x == y)  # Равно: False
print(x != y)  # Не равно: True
print(x < y)   # Меньше: True
print(x > y)   # Больше: False
print(x <= y)  # Меньше или равно: True
print(x >= y)  # Больше или равно: False
```

## Логические операторы

```python
a = True
b = False

print(a and b)  # И: False
print(a or b)   # ИЛИ: True
print(not a)    # НЕ: False
```

## Операторы присваивания

```python
x = 5
x += 3  # x = x + 3, результат: 8
x -= 2  # x = x - 2, результат: 6
x *= 2  # x = x * 2, результат: 12
x /= 3  # x = x / 3, результат: 4.0
```""",
        "assignment": {
            "title": "Калькулятор",
            "description": "Создайте простой калькулятор",
            "instructions": "Напишите программу, которая выполняет основные арифметические операции (+, -, *, /) с двумя числами. Выведите результаты всех операций."
        }
    },
    {
        "title": "Условные операторы",
        "content": """# Условные операторы

Условные операторы позволяют выполнять код в зависимости от условий.

## Оператор if

```python
age = 18

if age >= 18:
    print("Вы совершеннолетний")
```

## Оператор if-else

```python
temperature = 25

if temperature > 20:
    print("Тепло")
else:
    print("Холодно")
```

## Оператор if-elif-else

```python
score = 85

if score >= 90:
    grade = "Отлично"
elif score >= 75:
    grade = "Хорошо"
elif score >= 60:
    grade = "Удовлетворительно"
else:
    grade = "Неудовлетворительно"

print(f"Оценка: {grade}")
```

## Тернарный оператор

```python
age = 20
status = "Взрослый" if age >= 18 else "Ребенок"
```

## Вложенные условия

```python
weather = "солнечно"
temperature = 25

if weather == "солнечно":
    if temperature > 20:
        print("Отличная погода для прогулки!")
    else:
        print("Солнечно, но прохладно")
else:
    print("Погода не очень")
```""",
        "assignment": {
            "title": "Система оценок",
            "description": "Создайте систему оценки результатов",
            "instructions": "Напишите программу, которая принимает оценку (число от 0 до 100) и выводит соответствующую буквенную оценку: A (90-100), B (75-89), C (60-74), D (50-59), F (0-49)."
        }
    },
    {
        "title": "Циклы",
        "content": """# Циклы в Python

Циклы позволяют повторять выполнение кода несколько раз.

## Цикл for

```python
# Перебор элементов списка
fruits = ["яблоко", "банан", "апельсин"]
for fruit in fruits:
    print(fruit)

# Цикл с range
for i in range(5):
    print(i)  # Выведет: 0, 1, 2, 3, 4

# Range с параметрами
for i in range(1, 6):
    print(i)  # Выведет: 1, 2, 3, 4, 5

# Range с шагом
for i in range(0, 10, 2):
    print(i)  # Выведет: 0, 2, 4, 6, 8
```

## Цикл while

```python
count = 0
while count < 5:
    print(count)
    count += 1
```

## Управление циклами

### break - выход из цикла
```python
for i in range(10):
    if i == 5:
        break
    print(i)  # Выведет: 0, 1, 2, 3, 4
```

### continue - пропуск итерации
```python
for i in range(10):
    if i % 2 == 0:
        continue
    print(i)  # Выведет: 1, 3, 5, 7, 9
```

## Вложенные циклы

```python
for i in range(3):
    for j in range(3):
        print(f"i={i}, j={j}")
```""",
        "assignment": {
            "title": "Таблица умножения",
            "description": "Создайте таблицу умножения",
            "instructions": "Напишите программу, которая выводит таблицу умножения от 1 до 10. Используйте вложенные циклы for."
        }
    },
    {
        "title": "Списки и операции с ними",
        "content": """# Списки и операции с ними

Списки - это один из самых важных типов данных в Python.

## Создание списков

```python
# Пустой список
empty_list = []

# Список с элементами
numbers = [1, 2, 3, 4, 5]
fruits = ["яблоко", "банан", "апельсин"]
```

## Доступ к элементам

```python
fruits = ["яблоко", "банан", "апельсин"]
print(fruits[0])  # Первый элемент: "яблоко"
print(fruits[-1]) # Последний элемент: "апельсин"
```

## Изменение элементов

```python
fruits = ["яблоко", "банан", "апельсин"]
fruits[1] = "груша"
print(fruits)  # ["яблоко", "груша", "апельсин"]
```

## Методы списков

```python
fruits = ["яблоко", "банан"]

# Добавление элемента
fruits.append("апельсин")  # ["яблоко", "банан", "апельсин"]

# Вставка элемента
fruits.insert(1, "груша")  # ["яблоко", "груша", "банан", "апельсин"]

# Удаление элемента
fruits.remove("банан")  # ["яблоко", "груша", "апельсин"]

# Удаление по индексу
del fruits[0]  # ["груша", "апельсин"]

# Длина списка
print(len(fruits))  # 2

# Сортировка
numbers = [3, 1, 4, 1, 5]
numbers.sort()  # [1, 1, 3, 4, 5]
```

## Срезы (slicing)

```python
numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
print(numbers[2:5])    # [2, 3, 4]
print(numbers[:3])     # [0, 1, 2]
print(numbers[3:])     # [3, 4, 5, 6, 7, 8, 9]
print(numbers[::2])    # [0, 2, 4, 6, 8]
```""",
        "assignment": {
            "title": "Управление списком задач",
            "description": "Создайте систему управления задачами",
            "instructions": "Создайте программу для управления списком задач. Программа должна: 1) Добавлять задачи, 2) Удалять задачи, 3) Показывать все задачи, 4) Подсчитывать количество задач. Используйте методы списков."
        }
    },
    {
        "title": "Словари",
        "content": """# Словари (dictionaries)

Словари хранят данные в виде пар ключ-значение.

## Создание словарей

```python
# Пустой словарь
empty_dict = {}

# Словарь с элементами
person = {
    "name": "Иван",
    "age": 25,
    "city": "Москва"
}
```

## Доступ к элементам

```python
person = {"name": "Иван", "age": 25}
print(person["name"])  # "Иван"
print(person.get("age"))  # 25
print(person.get("email", "Не указан"))  # "Не указан"
```

## Изменение и добавление

```python
person = {"name": "Иван"}
person["age"] = 25  # Добавление
person["name"] = "Петр"  # Изменение
```

## Методы словарей

```python
person = {"name": "Иван", "age": 25}

# Получение всех ключей
print(person.keys())  # dict_keys(['name', 'age'])

# Получение всех значений
print(person.values())  # dict_values(['Иван', 25])

# Получение всех пар
print(person.items())  # dict_items([('name', 'Иван'), ('age', 25)])

# Удаление элемента
del person["age"]
person.pop("name")  # Удаляет и возвращает значение

# Проверка наличия ключа
if "name" in person:
    print("Ключ существует")
```

## Вложенные словари

```python
students = {
    "student1": {"name": "Иван", "age": 20, "grades": [5, 4, 5]},
    "student2": {"name": "Мария", "age": 21, "grades": [4, 5, 4]}
}
```""",
        "assignment": {
            "title": "База данных студентов",
            "description": "Создайте систему хранения данных о студентах",
            "instructions": "Создайте словарь, который хранит информацию о 3 студентах. Каждый студент должен иметь: имя, возраст, список оценок. Напишите программу, которая выводит информацию о каждом студенте и вычисляет средний балл для каждого."
        }
    },
    {
        "title": "Функции",
        "content": """# Функции в Python

Функции позволяют группировать код для повторного использования.

## Определение функции

```python
def greet():
    print("Привет, мир!")

greet()  # Вызов функции
```

## Функции с параметрами

```python
def greet(name):
    print(f"Привет, {name}!")

greet("Иван")  # Привет, Иван!
```

## Функции с возвращаемым значением

```python
def add(a, b):
    return a + b

result = add(5, 3)  # result = 8
```

## Параметры по умолчанию

```python
def greet(name, greeting="Привет"):
    print(f"{greeting}, {name}!")

greet("Иван")  # Привет, Иван!
greet("Мария", "Здравствуй")  # Здравствуй, Мария!
```

## Именованные параметры

```python
def create_person(name, age, city):
    return {"name": name, "age": age, "city": city}

person = create_person(age=25, city="Москва", name="Иван")
```

## Произвольное количество аргументов

```python
def sum_numbers(*args):
    total = 0
    for num in args:
        total += num
    return total

print(sum_numbers(1, 2, 3, 4))  # 10
```

## Локальные и глобальные переменные

```python
x = 10  # Глобальная переменная

def my_function():
    x = 5  # Локальная переменная
    print(x)  # 5

my_function()
print(x)  # 10
```""",
        "assignment": {
            "title": "Библиотека функций",
            "description": "Создайте набор полезных функций",
            "instructions": "Создайте следующие функции: 1) calculate_area(radius) - вычисляет площадь круга, 2) is_even(number) - проверяет четность числа, 3) find_max(numbers) - находит максимальное число в списке, 4) reverse_string(text) - переворачивает строку. Протестируйте все функции."
        }
    },
    {
        "title": "Работа с файлами",
        "content": """# Работа с файлами

Python предоставляет удобные инструменты для работы с файлами.

## Чтение файла

```python
# Чтение всего файла
with open("file.txt", "r", encoding="utf-8") as file:
    content = file.read()
    print(content)

# Чтение построчно
with open("file.txt", "r", encoding="utf-8") as file:
    for line in file:
        print(line.strip())
```

## Запись в файл

```python
# Запись в файл
with open("output.txt", "w", encoding="utf-8") as file:
    file.write("Привет, мир!\\n")
    file.write("Это вторая строка")

# Добавление в файл
with open("output.txt", "a", encoding="utf-8") as file:
    file.write("\\nНовая строка")
```

## Режимы открытия файла

- `"r"` - чтение (по умолчанию)
- `"w"` - запись (перезаписывает файл)
- `"a"` - добавление в конец файла
- `"x"` - создание нового файла
- `"b"` - бинарный режим

## Обработка ошибок

```python
try:
    with open("file.txt", "r", encoding="utf-8") as file:
        content = file.read()
except FileNotFoundError:
    print("Файл не найден")
except Exception as e:
    print(f"Произошла ошибка: {e}")
```

## Работа с JSON

```python
import json

# Запись в JSON
data = {"name": "Иван", "age": 25}
with open("data.json", "w", encoding="utf-8") as file:
    json.dump(data, file, ensure_ascii=False, indent=2)

# Чтение из JSON
with open("data.json", "r", encoding="utf-8") as file:
    data = json.load(file)
    print(data)
```""",
        "assignment": {
            "title": "Файловый менеджер",
            "description": "Создайте программу для работы с файлами",
            "instructions": "Создайте программу, которая: 1) Создает текстовый файл и записывает в него список из 5 ваших любимых книг, 2) Читает файл и выводит содержимое, 3) Добавляет новую книгу в конец файла, 4) Создает JSON файл с информацией о вас (имя, возраст, хобби) и читает его обратно."
        }
    },
    {
        "title": "Обработка исключений",
        "content": """# Обработка исключений

Исключения позволяют обрабатывать ошибки в программе.

## Базовый try-except

```python
try:
    result = 10 / 0
except ZeroDivisionError:
    print("Деление на ноль невозможно!")
```

## Несколько исключений

```python
try:
    number = int(input("Введите число: "))
    result = 10 / number
except ValueError:
    print("Это не число!")
except ZeroDivisionError:
    print("Нельзя делить на ноль!")
```

## Общий обработчик

```python
try:
    # какой-то код
    pass
except Exception as e:
    print(f"Произошла ошибка: {e}")
```

## try-except-else

```python
try:
    result = 10 / 2
except ZeroDivisionError:
    print("Деление на ноль!")
else:
    print(f"Результат: {result}")  # Выполнится, если ошибок нет
```

## try-except-finally

```python
try:
    file = open("data.txt", "r")
    content = file.read()
except FileNotFoundError:
    print("Файл не найден")
finally:
    file.close()  # Выполнится всегда
```

## Вызов исключений

```python
def check_age(age):
    if age < 0:
        raise ValueError("Возраст не может быть отрицательным")
    if age > 150:
        raise ValueError("Возраст слишком большой")
    return age

try:
    check_age(-5)
except ValueError as e:
    print(e)
```""",
        "assignment": {
            "title": "Безопасный калькулятор",
            "description": "Создайте калькулятор с обработкой ошибок",
            "instructions": "Создайте калькулятор, который безопасно обрабатывает: деление на ноль, ввод нечисловых значений, отсутствие файла при чтении данных. Используйте try-except блоки для всех операций."
        }
    },
    {
        "title": "Классы и объекты",
        "content": """# Классы и объекты

Классы позволяют создавать собственные типы данных.

## Определение класса

```python
class Person:
    def __init__(self, name, age):
        self.name = name
        self.age = age
    
    def introduce(self):
        return f"Меня зовут {self.name}, мне {self.age} лет"

# Создание объекта
person = Person("Иван", 25)
print(person.introduce())
```

## Методы класса

```python
class Calculator:
    def __init__(self):
        self.result = 0
    
    def add(self, value):
        self.result += value
        return self
    
    def multiply(self, value):
        self.result *= value
        return self
    
    def get_result(self):
        return self.result

calc = Calculator()
result = calc.add(5).multiply(3).get_result()  # 15
```

## Наследование

```python
class Animal:
    def __init__(self, name):
        self.name = name
    
    def speak(self):
        return "Животное издает звук"

class Dog(Animal):
    def speak(self):
        return f"{self.name} говорит: Гав-гав!"

dog = Dog("Бобик")
print(dog.speak())  # Бобик говорит: Гав-гав!
```

## Инкапсуляция

```python
class BankAccount:
    def __init__(self, balance):
        self._balance = balance  # Защищенный атрибут
    
    def deposit(self, amount):
        if amount > 0:
            self._balance += amount
    
    def get_balance(self):
        return self._balance

account = BankAccount(1000)
account.deposit(500)
print(account.get_balance())  # 1500
```""",
        "assignment": {
            "title": "Система управления библиотекой",
            "description": "Создайте классы для управления книгами",
            "instructions": "Создайте класс Book с атрибутами: title, author, year, is_available. Добавьте методы: borrow() (взять книгу), return_book() (вернуть книгу). Создайте класс Library с методом add_book() и списком книг. Протестируйте систему."
        }
    },
    {
        "title": "Модули и пакеты",
        "content": """# Модули и пакеты

Модули позволяют организовывать код в отдельные файлы.

## Импорт модуля

```python
import math
print(math.pi)  # 3.141592653589793
print(math.sqrt(16))  # 4.0
```

## Импорт конкретных функций

```python
from math import sqrt, pi
print(sqrt(16))  # 4.0
print(pi)  # 3.141592653589793
```

## Импорт с псевдонимом

```python
import math as m
print(m.pi)

from datetime import datetime as dt
now = dt.now()
```

## Создание собственного модуля

Создайте файл `my_module.py`:
```python
def greet(name):
    return f"Привет, {name}!"

PI = 3.14
```

Использование:
```python
import my_module
print(my_module.greet("Иван"))
print(my_module.PI)
```

## Стандартные модули

### datetime
```python
from datetime import datetime, timedelta
now = datetime.now()
tomorrow = now + timedelta(days=1)
```

### random
```python
import random
number = random.randint(1, 10)
choice = random.choice(["яблоко", "банан", "апельсин"])
```

### os
```python
import os
current_dir = os.getcwd()
files = os.listdir(".")
```

## Пакеты

Пакет - это папка с файлом `__init__.py`:
```
my_package/
    __init__.py
    module1.py
    module2.py
```

Импорт:
```python
from my_package import module1
```""",
        "assignment": {
            "title": "Создание модуля утилит",
            "description": "Создайте собственный модуль с полезными функциями",
            "instructions": "Создайте модуль utils.py с функциями: 1) format_currency(amount) - форматирует число как валюту, 2) generate_password(length) - генерирует случайный пароль, 3) validate_email(email) - проверяет email. Создайте другой файл, который импортирует и использует эти функции."
        }
    },
    {
        "title": "Работа с данными",
        "content": """# Работа с данными

Python отлично подходит для обработки и анализа данных.

## Списки и генераторы

### List comprehension
```python
# Создание списка квадратов
squares = [x**2 for x in range(10)]
# [0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

# С условием
evens = [x for x in range(20) if x % 2 == 0]
# [0, 2, 4, 6, 8, 10, 12, 14, 16, 18]
```

### Dictionary comprehension
```python
squares_dict = {x: x**2 for x in range(5)}
# {0: 0, 1: 1, 2: 4, 3: 9, 4: 16}
```

## Функции высшего порядка

### map
```python
numbers = [1, 2, 3, 4, 5]
squared = list(map(lambda x: x**2, numbers))
# [1, 4, 9, 16, 25]
```

### filter
```python
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
evens = list(filter(lambda x: x % 2 == 0, numbers))
# [2, 4, 6, 8, 10]
```

### reduce
```python
from functools import reduce
numbers = [1, 2, 3, 4, 5]
sum_all = reduce(lambda x, y: x + y, numbers)
# 15
```

## Работа с CSV

```python
import csv

# Чтение CSV
with open("data.csv", "r", encoding="utf-8") as file:
    reader = csv.DictReader(file)
    for row in reader:
        print(row)

# Запись CSV
data = [
    {"name": "Иван", "age": 25},
    {"name": "Мария", "age": 30}
]
with open("output.csv", "w", encoding="utf-8", newline="") as file:
    writer = csv.DictWriter(file, fieldnames=["name", "age"])
    writer.writeheader()
    writer.writerows(data)
```""",
        "assignment": {
            "title": "Анализ данных",
            "description": "Создайте программу для анализа данных",
            "instructions": "Создайте список словарей с данными о студентах (имя, оценки). Используя list comprehension, создайте список студентов со средним баллом выше 4. Используя map и filter, найдите всех студентов с хотя бы одной оценкой 5. Выведите результаты."
        }
    },
    {
        "title": "Декораторы",
        "content": """# Декораторы

Декораторы позволяют расширять функциональность функций.

## Простой декоратор

```python
def my_decorator(func):
    def wrapper():
        print("До вызова функции")
        func()
        print("После вызова функции")
    return wrapper

@my_decorator
def say_hello():
    print("Привет!")

say_hello()
# До вызова функции
# Привет!
# После вызова функции
```

## Декоратор с параметрами функции

```python
def timer(func):
    import time
    def wrapper(*args, **kwargs):
        start = time.time()
        result = func(*args, **kwargs)
        end = time.time()
        print(f"Функция {func.__name__} выполнилась за {end - start:.2f} секунд")
        return result
    return wrapper

@timer
def slow_function():
    import time
    time.sleep(1)
    return "Готово"

slow_function()
```

## Декоратор с аргументами

```python
def repeat(times):
    def decorator(func):
        def wrapper(*args, **kwargs):
            for _ in range(times):
                result = func(*args, **kwargs)
            return result
        return wrapper
    return decorator

@repeat(times=3)
def greet(name):
    print(f"Привет, {name}!")

greet("Иван")
# Привет, Иван!
# Привет, Иван!
# Привет, Иван!
```

## Встроенные декораторы

### @property
```python
class Circle:
    def __init__(self, radius):
        self._radius = radius
    
    @property
    def area(self):
        return 3.14 * self._radius ** 2

circle = Circle(5)
print(circle.area)  # 78.5
```

### @staticmethod и @classmethod
```python
class Math:
    @staticmethod
    def add(a, b):
        return a + b
    
    @classmethod
    def multiply(cls, a, b):
        return a * b
```""",
        "assignment": {
            "title": "Создание декораторов",
            "description": "Создайте полезные декораторы",
            "instructions": "Создайте следующие декораторы: 1) @log_calls - логирует вызовы функции с аргументами, 2) @retry(max_attempts) - повторяет выполнение функции при ошибке, 3) @validate_types - проверяет типы аргументов. Примените их к различным функциям."
        }
    },
    {
        "title": "Итоговый проект",
        "content": """# Итоговый проект

Поздравляем! Вы прошли весь курс по основам Python. Теперь пришло время применить все полученные знания.

## Что вы изучили:

1. ✅ Основы Python и переменные
2. ✅ Типы данных
3. ✅ Операторы и выражения
4. ✅ Условные операторы
5. ✅ Циклы
6. ✅ Списки и словари
7. ✅ Функции
8. ✅ Работа с файлами
9. ✅ Обработка исключений
10. ✅ Классы и объекты
11. ✅ Модули и пакеты
12. ✅ Работа с данными
13. ✅ Декораторы

## Рекомендации для дальнейшего изучения:

- **Веб-разработка**: Flask, Django
- **Наука о данных**: NumPy, Pandas, Matplotlib
- **Машинное обучение**: Scikit-learn, TensorFlow
- **Автоматизация**: Selenium, Requests
- **Базы данных**: SQLAlchemy, PostgreSQL

## Практика - ключ к успеху!

Продолжайте практиковаться, решайте задачи, участвуйте в проектах. Программирование - это навык, который развивается через практику.

Удачи в вашем пути программиста! 🚀""",
        "assignment": {
            "title": "Финальный проект: Система управления задачами",
            "description": "Создайте полноценное приложение",
            "instructions": "Создайте консольное приложение для управления задачами со следующими функциями: 1) Добавление задач с приоритетом и датой, 2) Просмотр всех задач, 3) Отметка задач как выполненных, 4) Удаление задач, 5) Сохранение задач в файл JSON, 6) Загрузка задач из файла, 7) Фильтрация по статусу и приоритету. Используйте классы, функции, обработку исключений и работу с файлами."
        }
    }
]

def create_course_with_lessons():
    db = SessionLocal()
    try:
        course_repo = CourseRepository(db)
        existing_course = db.query(Course).filter(Course.title == COURSE_DATA["title"]).first()
        
        if existing_course:
            print(f"Course '{COURSE_DATA['title']}' already exists!")
            return
        course_data = CourseCreate(**COURSE_DATA)
        course = course_repo.create_course(course_data)
        print(f"[OK] Created course: {course.title}")
        
        lesson_repo = LessonRepository(db)
        assignment_repo = AssignmentRepository(db)
        
        for i, lesson_data in enumerate(LESSONS_DATA, 1):
            lesson_create = LessonCreate(
                course_id=course.id,
                title=lesson_data["title"],
                content=lesson_data["content"]
            )
            lesson = lesson_repo.create_lesson(lesson_create)
            print(f"  [OK] Lesson {i}: {lesson.title}")
            
            # Создаем задание для урока
            assignment_data = AssignmentCreate(
                lesson_id=lesson.id,
                title=lesson_data["assignment"]["title"],
                description=lesson_data["assignment"]["description"],
                instructions=lesson_data["assignment"]["instructions"]
            )
            assignment = assignment_repo.create_assignment(assignment_data)
            print(f"    [OK] Assignment: {assignment.title}")
        
        print(f"\n[SUCCESS] Created: 1 course, {len(LESSONS_DATA)} lessons, {len(LESSONS_DATA)} assignments!")
        
    except Exception as e:
        print(f"[ERROR] Error: {e}")
        db.rollback()
    finally:
        db.close()

if __name__ == "__main__":
    create_course_with_lessons()

